tomaskovacik/MightyCore/avr/variants/nanoXX4/pins_arduino.h
/***************************************************|
|           NANOXX4PX PINOUT for MightyCore         |
|               based on MightyCore work            |
|       https://github.com/MCUdude/MightyCore       |
|    https://github.com/tomaskovacik/MightyCore     |
|       pinout for the board designed by me         |
https://www.tindie.com/products/tomaskovacik/nanoxx4px/                                                   |
| An Arduino core for:                              |
| ATmega1284/P                                      |
| ATmega644/A/P/PA                                  |
| ATmega324A/P/PA/PB                                |
| ATmega164A/P/PA                                   |
| ATmega32/A                                        |
| ATmega16/A                                        |
| ATmega8535                                        |
|                                                   |
|***************************************************/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#if defined(__AVR_ATmega644A__)
  #define __AVR_ATmega644__
#endif


// We're using the Bobuino pinout
#define NANOXX4_PINOUT


// Digital pins
  #define NUM_DIGITAL_PINS          (41)

// PWM pins
#if defined(__AVR_ATmega8535__) || defined(__AVR_ATmega16__) || defined(__AVR_ATmega32__)
  #define digitalPinHasPWM(p)       ((p) == 7 || (p) == 8 || (p) == 30 || (p) == 31)
#elif defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__)
  #define digitalPinHasPWM(p)       ((p) == 9 || (p) == 5 || (p) == 8 || (p) == 10 || (p) == 4 || (p) == 7)
#elif defined(__AVR_ATmega324PB__)
  #define digitalPinHasPWM(p)       ((p) == 9 || (p) == 5 || (p) == 8 || (p) == 10 || (p) == 12 || (p) == 13 || (p) == 17 || (p) == 4 || (p) == 7)
#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__)
  #define digitalPinHasPWM(p)       ((p) == 9 || (p) == 5 || (p) == 8 || (p) == 10 || (p) == 12 || (p) == 13 || (p) == 4 || (p) == 7)
#endif

// Builtin LED
#define LED_BUILTIN   (13)
static const uint8_t LED = LED_BUILTIN;

// Analog pins
#define PIN_A0 (54)
#define PIN_A1 (55)
#define PIN_A2 (56)
#define PIN_A3 (57)
#define PIN_A4 (58)
#define PIN_A5 (59)
#define PIN_A6 (60)
#define PIN_A7 (61)
static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;
static const uint8_t A5 = PIN_A5;
static const uint8_t A6 = PIN_A6;
static const uint8_t A7 = PIN_A7;
#define NUM_ANALOG_INPUTS           (8)
#define analogInputToDigitalPin(p)  ((p < NUM_ANALOG_INPUTS) ? (p) + 54 : -1)
#define analogPinToChannel(p)       ((p) < NUM_ANALOG_INPUTS) ? (7 - (p)) : ((p)  >=  54 && (p) <= 61) ? (61 - (p)) : -1

// SPI
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (11)
#define PIN_SPI_MISO  (12)
#define PIN_SPI_SCK   (13)
static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;
#if defined(__AVR_ATmega324PB__)
  #define PIN_SPI_SS0   PIN_SPI_SS
  #define PIN_SPI_MOSI0 PIN_SPI_MOSI
  #define PIN_SPI_MISO0 PIN_SPI_MISO
  #define PIN_SPI_SCK0  PIN_SPI_SCK
  #define PIN_SPI_SS1   (8)
  #define PIN_SPI_MOSI1 (37)
  #define PIN_SPI_MISO1 (36)
  #define PIN_SPI_SCK1  (7)
  static const uint8_t SS0   = PIN_SPI_SS0;
  static const uint8_t MOSI0 = PIN_SPI_MOSI0;
  static const uint8_t MISO0 = PIN_SPI_MISO0;
  static const uint8_t SCK0  = PIN_SPI_SCK0;
  static const uint8_t SS1   = PIN_SPI_SS1;
  static const uint8_t MOSI1 = PIN_SPI_MOSI1;
  static const uint8_t MISO1 = PIN_SPI_MISO1;
  static const uint8_t SCK1  = PIN_SPI_SCK1;
#endif  

// i2c
#define PIN_WIRE_SDA  (20)
#define PIN_WIRE_SCL  (21)
static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;
#if defined(__AVR_ATmega324PB__)
  #define PIN_WIRE_SDA0 PIN_WIRE_SDA
  #define PIN_WIRE_SCL0 PIN_WIRE_SCL
  #define PIN_WIRE_SDA1 (37)
  #define PIN_WIRE_SCL1 (38)
  static const uint8_t SDA0  = PIN_WIRE_SDA0;
  static const uint8_t SCL0  = PIN_WIRE_SCL0;
  static const uint8_t SDA1  = PIN_WIRE_SDA1;
  static const uint8_t SCL1  = PIN_WIRE_SCL1;
#endif

// Interrupts
#define EXTERNAL_NUM_INTERRUPTS     (3)
#define digitalPinToInterrupt(p)    ((p) == 2 ? 0 : ((p) == 3 ? 1 : ((p) == 6 ? 2 : NOT_AN_INTERRUPT)))

// PCINT
#if defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega324PB__) || \
defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega1284__) || \
defined(__AVR_ATmega1284P__)
#if defined(__AVR_ATmega324PB__)
#define PORT_NDX_TO_PCMSK(x) ((x) == 0 ? &PCMSK0 : ((x) == 1 ? &PCMSK1 : ((x) == 2 ? &PCMSK2 : ((x) == 3 ? &PCMSK3 : ((x) == 4 ? &PCMSK4 : (uint8_t *)0)))))
#define ifpin(p,what,ifnot)         ((((p) >= 0 && (p) < 23) || ((p) >= 32 && (p) < 40) || ((p) >= 54 && (p) < 61)) ? (what) : (ifnot))
#else
#define PORT_NDX_TO_PCMSK(x) ((x) == 0 ? &PCMSK0 : ((x) == 1 ? &PCMSK1 : ((x) == 2 ? &PCMSK2 : ((x) == 3 ? &PCMSK3 : (uint8_t *)0))))
#define ifpin(p,what,ifnot)         ((((p) >= 0 && (p) < 23) || ((p) >= 32 && (p) < 33) || ((p) >= 54 && (p) < 61)) ? (what) : (ifnot))
#endif
#define digitalPinToPCICR(p)    ifpin(p,&PCICR,(uint8_t *)0)
#define digitalPinToPCICRbit(p) ifpin(p,digital_pin_to_pcint[p] >> 3,0)
#define digitalPinToPCMSK(p)    ifpin(p,(uint8_t *)PORT_NDX_TO_PCMSK(digital_pin_to_pcint[p] >> 3),(uint8_t *)0)
#define digitalPinToPCMSKbit(p) ifpin(p,digital_pin_to_pcint[p] & 0x7,0)


#ifndef ARDUINO_MAIN
extern const uint8_t digital_pin_to_pcint[];
#else
const uint8_t digital_pin_to_pcint[NUM_DIGITAL_PINS] =
{
24,//D0,PD0,RX0,0
25,//D1,PD1,TX0,1
26,//D2,PD2,INT0,2
27,//D3,PD3,INT1,3
28,//D4,PD4,,4
29,//D5,PD5,,5
10,//D6,PB2,INT2,6
31,//D7,PD7,SCK1,7
30,//D8,PD6,SS1,8
11,//D9,PB3,,9
12,//D10,PB4,SS0,10
13,//D11,PB5,MOSI0,11
14,//D12,PB6,MISO0,12
15,//D13,PB7,SCK0,13
 8,//D14,PB0,,14
 9,//D15,PB1,,15
19,//D16,PC3,,16
20,//D17,PC4,,17
27,//D18,PD3,RX1,18
26,//D19,PD2,TX1,19
17,//D20,PC1,SDA0,20
16,//D21,PC0,SCL0,21
22,//D22,PC6,,22
23,//D23,PC7,,23
NULL,//24
NULL,//25
NULL,//26
NULL,//27
NULL,//28
NULL,//9
NULL,//30
NULL,//31
18,//D32,PC2,,32
21,//D33,PC5,,33
#if defined(__AVR_ATmega324PB__)
32,//D34,PE0,,34
33,//D35,PE1,,35
34,//D36,PE2,MISO1,36
35,//D37,PE3,MOSI1,37
36,//D38,PE4,AREF,38
37,//D39,PE5,SDA1,39
38,//D40,PE6,SCL1,40
#else
NULL,//34
NULL,//35
NULL,//36
NULL,//37
NULL,//38
NULL,//39
NULL,//40
#endif
NULL,//41
NULL,//42
NULL,//43
NULL,//44
NULL,//45
NULL,//46
NULL,//47
NULL,//48
NULL,//49
NULL,//50
NULL,//51
NULL,//52
NULL,//53
 0,//A0/D54,PA0,ADC0,54
 1,//A1/D55,PA1,ADC1,55
 2,//A2/D56,PA2,ADC2,56
 3,//A3/D57,PA3,ADC3,57
 4,//A4/D58,PA4,ADC4,58
 5,//A5/D59,PA5,ADC5,59
 6,//A6/D60,PA6,ADC6,60
 7,//A7/D61,PA7,ADC7,61
};
#endif

#endif


#ifdef ARDUINO_MAIN

#define PA 1
#define PB 2
#define PC 3
#define PD 4
#if defined(__AVR_ATmega324PB__)
  #define PE 5
#endif

