tomaskovacik/MightyCore/avr/variants/nanoXX4/pins_arduino.h
// these arrays map port names (e.g. port B) to the
// appropriate addresses for various functions (e.g. reading
// and writing)
const uint16_t PROGMEM port_to_mode_PGM[] =
{
  NOT_A_PORT,
  (uint16_t) &DDRA,
  (uint16_t) &DDRB,
  (uint16_t) &DDRC,
  (uint16_t) &DDRD,
#if defined(__AVR_ATmega324PB__)
  (uint16_t) &DDRE,
#endif
};

const uint16_t PROGMEM port_to_output_PGM[] =
{
  NOT_A_PORT,
  (uint16_t) &PORTA,
  (uint16_t) &PORTB,
  (uint16_t) &PORTC,
  (uint16_t) &PORTD,
#if defined(__AVR_ATmega324PB__)
  (uint16_t) &PORTE,
#endif
};

const uint16_t PROGMEM port_to_input_PGM[] =
{
  NOT_A_PORT,
  (uint16_t) &PINA,
  (uint16_t) &PINB,
  (uint16_t) &PINC,
  (uint16_t) &PIND,
#if defined(__AVR_ATmega324PB__)
  (uint16_t) &PINE,
#endif
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] =
{
PD,//D24,D0,PD0,RX0,0
PD,//D25,D1,PD1,TX0,1
PD,//D26,D2,PD2,INT0,2
PD,//D27,D3,PD3,INT1,3
PD,//D28,D4,PD4,,4
PD,//D29,D5,PD5,,5
PB,//D10,D6,PB2,INT2,6
PD,//D31,D7,PD7,SCK1,7
PD,//D30,D8,PD6,SS1,8
PB,//D11,D9,PB3,,9
PB,//D12,D10,PB4,SS0,10
PB,//D13,D11,PB5,MOSI0,11
PB,//D14,D12,PB6,MISO0,12
PB,//D15,D13,PB7,SCK0,13
PB,//D8,D14,PB0,,14
PB,//D9,D15,PB1,,15
PC,//D19,D16,PC3,,16
PC,//D20,D17,PC4,,17
PD,//D27,D18,PD3,RX1,18
PD,//D26,D19,PD2,TX1,19
PC,//D17,D20,PC1,SDA0,20
PC,//D16,D21,PC0,SCL0,21
PC,//D22,D22,PC6,,22
PC,//D23,D23,PC7,,23
PC,//D18,D32,PC2,,32
PC,//D21,D33,PC5,,33
NULL,//24
NULL,//25
NULL,//26
NULL,//27
NULL,//28
NULL,//9
NULL,//30
NULL,//31
#if defined(__AVR_ATmega324PB__)
PE,//D32,D34,PE0,,34
PE,//D33,D35,PE1,,35
PE,//D34,D36,PE2,MISO1,36
PE,//D35,D37,PE3,MOSI1,37
PE,//D36,D38,PE4,AREF,38
PE,//D37,D39,PE5,SDA1,39
PE,//D38,D40,PE6,SCL1,40
#else
NULL,//34
NULL,//35
NULL,//36
NULL,//37
NULL,//38
NULL,//39
NULL,//40
#endif
NULL,//41
NULL,//42
NULL,//43
NULL,//44
NULL,//45
NULL,//46
NULL,//47
NULL,//48
NULL,//49
NULL,//50
NULL,//51
NULL,//52
NULL,//53
PA,//D0,A0/D54,PA0,ADC0,54
PA,//D1,A1/D55,PA1,ADC1,55
PA,//D2,A2/D56,PA2,ADC2,56
PA,//D3,A3/D57,PA3,ADC3,57
PA,//D4,A4/D58,PA4,ADC4,58
PA,//D5,A5/D59,PA5,ADC5,59
PA,//D6,A6/D60,PA6,ADC6,60
PA,//D7,A7/D61,PA7,ADC7,61
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] =
{
_BV(0),//PD,24,D0,PD0,RX0,0
_BV(1),//PD,25,D1,PD1,TX0,1
_BV(2),//PD,26,D2,PD2,INT0,2
_BV(3),//PD,27,D3,PD3,INT1,3
_BV(4),//PD,28,D4,PD4,,4
_BV(5),//PD,29,D5,PD5,,5
_BV(2),//PB,10,D6,PB2,INT2,6
_BV(7),//PD,31,D7,PD7,SCK1,7
_BV(6),//PD,30,D8,PD6,SS1,8
_BV(3),//PB,11,D9,PB3,,9
_BV(4),//PB,12,D10,PB4,SS0,10
_BV(5),//PB,13,D11,PB5,MOSI0,11
_BV(6),//PB,14,D12,PB6,MISO0,12
_BV(7),//PB,15,D13,PB7,SCK0,13
_BV(0),//PB,8,D14,PB0,,14
_BV(1),//PB,9,D15,PB1,,15
_BV(3),//PC,19,D16,PC3,,16
_BV(4),//PC,20,D17,PC4,,17
_BV(3),//PD,27,D18,PD3,RX1,18
_BV(2),//PD,26,D19,PD2,TX1,19
_BV(1),//PC,17,D20,PC1,SDA0,20
_BV(0),//PC,16,D21,PC0,SCL0,21
_BV(6),//PC,22,D22,PC6,,22
_BV(7),//PC,23,D23,PC7,,23
_BV(2),//PC,18,D32,PC2,,32
_BV(5),//PC,21,D33,PC5,,33
NULL,//24
NULL,//25
NULL,//26
NULL,//27
NULL,//28
NULL,//29
NULL,//30
NULL,//31
#if defined(__AVR_ATmega324PB__)
_BV(0),//PE,32,D34,PE0,,34
_BV(1),//PE,33,D35,PE1,,35
_BV(2),//PE,34,D36,PE2,MISO1,36
_BV(3),//PE,35,D37,PE3,MOSI1,37
_BV(4),//PE,36,D38,PE4,AREF,38
_BV(5),//PE,37,D39,PE5,SDA1,39
_BV(6),//PE,38,D40,PE6,SCL1,40
#else
NULL,//34
NULL,//35
NULL,//36
NULL,//37
NULL,//38
NULL,//39
NULL,//40
#endif
NULL,//41
NULL,//42
NULL,//43
NULL,//44
NULL,//45
NULL,//46
NULL,//47
NULL,//48
NULL,//49
NULL,//50
NULL,//51
NULL,//52
NULL,//53
_BV(0),//PA,0,A0/D54,PA0,ADC0,54
_BV(1),//PA,1,A1/D55,PA1,ADC1,55
_BV(2),//PA,2,A2/D56,PA2,ADC2,56
_BV(3),//PA,3,A3/D57,PA3,ADC3,57
_BV(4),//PA,4,A4/D58,PA4,ADC4,58
_BV(5),//PA,5,A5/D59,PA5,ADC5,59
_BV(6),//PA,6,A6/D60,PA6,ADC6,60
_BV(7),//PA,7,A7/D61,PA7,ADC7,61
};

#if defined(__AVR_ATmega8535__) || defined(__AVR_ATmega16__) || defined(__AVR_ATmega32__)
const uint8_t PROGMEM digital_pin_to_timer_PGM[] =
{
  NOT_ON_TIMER, // D0 - PD0
  NOT_ON_TIMER, // D1 - PD1
  NOT_ON_TIMER, // D2 - PD2
  NOT_ON_TIMER, // D3 - PD3
  NOT_ON_TIMER, // D4 - PB0
  NOT_ON_TIMER, // D5 - PB1
  NOT_ON_TIMER, // D6 - PB2
  TIMER0A,      // D7 - PB3
  TIMER1A,      // D8 - PD5
  NOT_ON_TIMER, // D9 - PD6
  NOT_ON_TIMER, // D10 - PB4
  NOT_ON_TIMER, // D11 - PB5
  NOT_ON_TIMER, // D12 - PB6
  NOT_ON_TIMER, // D13 - PB7
  NOT_ON_TIMER, // D14 - PA7
  NOT_ON_TIMER, // D15 - PA6
  NOT_ON_TIMER, // D16 - PA5
  NOT_ON_TIMER, // D17 - PA4
  NOT_ON_TIMER, // D18 - PA3
  NOT_ON_TIMER, // D19 - PA2
  NOT_ON_TIMER, // D20 - PA1
  NOT_ON_TIMER, // D21 - PA0
  NOT_ON_TIMER, // D22 - PC0
  NOT_ON_TIMER, // D23 - PC1
  NOT_ON_TIMER, // D24 - PC2
  NOT_ON_TIMER, // D25 - PC3
  NOT_ON_TIMER, // D26 - PC4
  NOT_ON_TIMER, // D27 - PC5
  NOT_ON_TIMER, // D28 - PC6
  NOT_ON_TIMER, // D29 - PC7
  TIMER1B,      // D30 - PD4
  TIMER2,       // D31 - PD7
};

#elif defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega644A__) || \
defined(__AVR_ATmega644P__)
const uint8_t PROGMEM digital_pin_to_timer_PGM[] =
{
NOT_ON_TIMER,//D0,PD0,_BV(0),PD,24,RX0,0,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D1,PD1,_BV(1),PD,25,TX0,1,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D2,PD2,_BV(2),PD,26,INT0,2,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D3,PD3,_BV(3),PD,27,INT1,3,,NOT_ON_TIMER,NOT_ON_TIMER
TIMER1B,//D4,PD4,_BV(4),PD,28,,4,,TIMER1B,TIMER1B
TIMER1A,//D5,PD5,_BV(5),PD,29,,5,,TIMER1A,TIMER1A
NOT_ON_TIMER,//D6,PB2,_BV(2),PB,10,INT2,6,,NOT_ON_TIMER,NOT_ON_TIMER
TIMER2A,//D7,PD7,_BV(7),PD,31,SCK1,7,,TIMER2A,TIMER2A
TIMER2B,//D8,PD6,_BV(6),PD,30,SS1,8,,TIMER2B,TIMER2B
TIMER0A,//D9,PB3,_BV(3),PB,11,,9,,TIMER0A,TIMER0A
TIMER0B,//D10,PB4,_BV(4),PB,12,SS0,10,,TIMER0B,TIMER0B
NOT_ON_TIMER,//D11,PB5,_BV(5),PB,13,MOSI0,11,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D12,PB6,_BV(6),PB,14,MISO0,12,,TIMER3A,TIMER3A
NOT_ON_TIMER,//D13,PB7,_BV(7),PB,15,SCK0,13,,TIMER3B,TIMER3B
NOT_ON_TIMER,//D14,PB0,_BV(0),PB,8,,14,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D15,PB1,_BV(1),PB,9,,15,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D16,PC3,_BV(3),PC,19,,16,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D17,PC4,_BV(4),PC,20,,17,,NOT_ON_TIMER,TIMER4A
NOT_ON_TIMER,//D18,PD3,_BV(3),PD,27,RX1,18,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D19,PD2,_BV(2),PD,26,TX1,19,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D20,PC1,_BV(1),PC,17,SDA0,20,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D21,PC0,_BV(0),PC,16,SCL0,21,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D22,PC6,_BV(6),PC,22,,22,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D23,PC7,_BV(7),PC,23,,23,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D32,PC2,_BV(2),PC,18,,32,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D33,PC5,_BV(5),PC,21,,33,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//24
NOT_ON_TIMER,//25
NOT_ON_TIMER,//26
NOT_ON_TIMER,//27
NOT_ON_TIMER,//28
NOT_ON_TIMER,//9
NOT_ON_TIMER,//30
NOT_ON_TIMER,//31
NOT_ON_TIMER,//D34,PE0,_BV(0),PE,32,,34,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D35,PE1,_BV(1),PE,33,,35,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D36,PE2,_BV(2),PE,34,MISO1,36,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D37,PE3,_BV(3),PE,35,MOSI1,37,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D38,PE4,_BV(4),PE,36,AREF,38,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D39,PE5,_BV(5),PE,37,SDA1,39,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D40,PE6,_BV(6),PE,38,SCL1,40,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//41
NOT_ON_TIMER,//42
NOT_ON_TIMER,//43
NOT_ON_TIMER,//44
NOT_ON_TIMER,//45
NOT_ON_TIMER,//46
NOT_ON_TIMER,//47
NOT_ON_TIMER,//48
NOT_ON_TIMER,//49
NOT_ON_TIMER,//50
NOT_ON_TIMER,//51
NOT_ON_TIMER,//52
NOT_ON_TIMER,//53
NOT_ON_TIMER,//A0/D54,PA0,_BV(0),PA,0,ADC0,54,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A1/D55,PA1,_BV(1),PA,1,ADC1,55,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A2/D56,PA2,_BV(2),PA,2,ADC2,56,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A3/D57,PA3,_BV(3),PA,3,ADC3,57,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A4/D58,PA4,_BV(4),PA,4,ADC4,58,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A5/D59,PA5,_BV(5),PA,5,ADC5,59,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A6/D60,PA6,_BV(6),PA,6,ADC6,60,,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A7/D61,PA7,_BV(7),PA,7,ADC7,61,,NOT_ON_TIMER,NOT_ON_TIMER
};

#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__)
const uint8_t PROGMEM digital_pin_to_timer_PGM[] =
{
NOT_ON_TIMER,//D0,PD0,_BV(0),PD,24,RX0,0,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D1,PD1,_BV(1),PD,25,TX0,1,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D2,PD2,_BV(2),PD,26,INT0,2,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D3,PD3,_BV(3),PD,27,INT1,3,NOT_ON_TIMER,,NOT_ON_TIMER
TIMER1B,//D4,PD4,_BV(4),PD,28,,4,TIMER1B,,TIMER1B
TIMER1A,//D5,PD5,_BV(5),PD,29,,5,TIMER1A,,TIMER1A
NOT_ON_TIMER,//D6,PB2,_BV(2),PB,10,INT2,6,NOT_ON_TIMER,,NOT_ON_TIMER
TIMER2A,//D7,PD7,_BV(7),PD,31,SCK1,7,TIMER2A,,TIMER2A
TIMER2B,//D8,PD6,_BV(6),PD,30,SS1,8,TIMER2B,,TIMER2B
TIMER0A,//D9,PB3,_BV(3),PB,11,,9,TIMER0A,,TIMER0A
TIMER0B,//D10,PB4,_BV(4),PB,12,SS0,10,TIMER0B,,TIMER0B
NOT_ON_TIMER,//D11,PB5,_BV(5),PB,13,MOSI0,11,NOT_ON_TIMER,,NOT_ON_TIMER
TIMER3A,//D12,PB6,_BV(6),PB,14,MISO0,12,NOT_ON_TIMER,,TIMER3A
TIMER3B,//D13,PB7,_BV(7),PB,15,SCK0,13,NOT_ON_TIMER,,TIMER3B
NOT_ON_TIMER,//D14,PB0,_BV(0),PB,8,,14,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D15,PB1,_BV(1),PB,9,,15,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D16,PC3,_BV(3),PC,19,,16,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D17,PC4,_BV(4),PC,20,,17,NOT_ON_TIMER,,TIMER4A
NOT_ON_TIMER,//D18,PD3,_BV(3),PD,27,RX1,18,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D19,PD2,_BV(2),PD,26,TX1,19,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D20,PC1,_BV(1),PC,17,SDA0,20,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D21,PC0,_BV(0),PC,16,SCL0,21,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D22,PC6,_BV(6),PC,22,,22,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D23,PC7,_BV(7),PC,23,,23,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D32,PC2,_BV(2),PC,18,,32,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D33,PC5,_BV(5),PC,21,,33,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//24
NOT_ON_TIMER,//25
NOT_ON_TIMER,//26
NOT_ON_TIMER,//27
NOT_ON_TIMER,//28
NOT_ON_TIMER,//9
NOT_ON_TIMER,//30
NOT_ON_TIMER,//31
NOT_ON_TIMER,//D34,PE0,_BV(0),PE,32,,34,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D35,PE1,_BV(1),PE,33,,35,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D36,PE2,_BV(2),PE,34,MISO1,36,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D37,PE3,_BV(3),PE,35,MOSI1,37,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D38,PE4,_BV(4),PE,36,AREF,38,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D39,PE5,_BV(5),PE,37,SDA1,39,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//D40,PE6,_BV(6),PE,38,SCL1,40,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//41
NOT_ON_TIMER,//42
NOT_ON_TIMER,//43
NOT_ON_TIMER,//44
NOT_ON_TIMER,//45
NOT_ON_TIMER,//46
NOT_ON_TIMER,//47
NOT_ON_TIMER,//48
NOT_ON_TIMER,//49
NOT_ON_TIMER,//50
NOT_ON_TIMER,//51
NOT_ON_TIMER,//52
NOT_ON_TIMER,//53
NOT_ON_TIMER,//A0/D54,PA0,_BV(0),PA,0,ADC0,54,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A1/D55,PA1,_BV(1),PA,1,ADC1,55,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A2/D56,PA2,_BV(2),PA,2,ADC2,56,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A3/D57,PA3,_BV(3),PA,3,ADC3,57,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A4/D58,PA4,_BV(4),PA,4,ADC4,58,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A5/D59,PA5,_BV(5),PA,5,ADC5,59,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A6/D60,PA6,_BV(6),PA,6,ADC6,60,NOT_ON_TIMER,,NOT_ON_TIMER
NOT_ON_TIMER,//A7/D61,PA7,_BV(7),PA,7,ADC7,61,NOT_ON_TIMER,,NOT_ON_TIMER

