tomaskovacik/MightyCore/avr/variants/nanoXX4/pins_arduino.h
};

#elif defined(__AVR_ATmega324PB__)
const uint8_t PROGMEM digital_pin_to_timer_PGM[] =
{
NOT_ON_TIMER,//D0,PD0,_BV(0),PD,24,RX0,0,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D1,PD1,_BV(1),PD,25,TX0,1,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D2,PD2,_BV(2),PD,26,INT0,2,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D3,PD3,_BV(3),PD,27,INT1,3,NOT_ON_TIMER,NOT_ON_TIMER
TIMER1B,//D4,PD4,_BV(4),PD,28,,4,TIMER1B,TIMER1B
TIMER1A,//D5,PD5,_BV(5),PD,29,,5,TIMER1A,TIMER1A
NOT_ON_TIMER,//D6,PB2,_BV(2),PB,10,INT2,6,NOT_ON_TIMER,NOT_ON_TIMER
TIMER2A,//D7,PD7,_BV(7),PD,31,SCK1,7,TIMER2A,TIMER2A
TIMER2B,//D8,PD6,_BV(6),PD,30,SS1,8,TIMER2B,TIMER2B
TIMER0A,//D9,PB3,_BV(3),PB,11,,9,TIMER0A,TIMER0A
TIMER0B,//D10,PB4,_BV(4),PB,12,SS0,10,TIMER0B,TIMER0B
NOT_ON_TIMER,//D11,PB5,_BV(5),PB,13,MOSI0,11,NOT_ON_TIMER,NOT_ON_TIMER
TIMER3A,//D12,PB6,_BV(6),PB,14,MISO0,12,NOT_ON_TIMER,TIMER3A
TIMER3B,//D13,PB7,_BV(7),PB,15,SCK0,13,NOT_ON_TIMER,TIMER3B
NOT_ON_TIMER,//D14,PB0,_BV(0),PB,8,,14,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D15,PB1,_BV(1),PB,9,,15,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D16,PC3,_BV(3),PC,19,,16,NOT_ON_TIMER,NOT_ON_TIMER
TIMER4A,//D17,PC4,_BV(4),PC,20,,17,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D18,PD3,_BV(3),PD,27,RX1,18,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D19,PD2,_BV(2),PD,26,TX1,19,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D20,PC1,_BV(1),PC,17,SDA0,20,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D21,PC0,_BV(0),PC,16,SCL0,21,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D22,PC6,_BV(6),PC,22,,22,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D23,PC7,_BV(7),PC,23,,23,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D32,PC2,_BV(2),PC,18,,32,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D33,PC5,_BV(5),PC,21,,33,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//24
NOT_ON_TIMER,//25
NOT_ON_TIMER,//26
NOT_ON_TIMER,//27
NOT_ON_TIMER,//28
NOT_ON_TIMER,//9
NOT_ON_TIMER,//30
NOT_ON_TIMER,//31
NOT_ON_TIMER,//D34,PE0,_BV(0),PE,32,,34,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D35,PE1,_BV(1),PE,33,,35,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D36,PE2,_BV(2),PE,34,MISO1,36,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D37,PE3,_BV(3),PE,35,MOSI1,37,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D38,PE4,_BV(4),PE,36,AREF,38,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D39,PE5,_BV(5),PE,37,SDA1,39,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//D40,PE6,_BV(6),PE,38,SCL1,40,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//41
NOT_ON_TIMER,//42
NOT_ON_TIMER,//43
NOT_ON_TIMER,//44
NOT_ON_TIMER,//45
NOT_ON_TIMER,//46
NOT_ON_TIMER,//47
NOT_ON_TIMER,//48
NOT_ON_TIMER,//49
NOT_ON_TIMER,//50
NOT_ON_TIMER,//51
NOT_ON_TIMER,//52
NOT_ON_TIMER,//53
NOT_ON_TIMER,//A0/D54,PA0,_BV(0),PA,0,ADC0,54,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A1/D55,PA1,_BV(1),PA,1,ADC1,55,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A2/D56,PA2,_BV(2),PA,2,ADC2,56,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A3/D57,PA3,_BV(3),PA,3,ADC3,57,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A4/D58,PA4,_BV(4),PA,4,ADC4,58,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A5/D59,PA5,_BV(5),PA,5,ADC5,59,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A6/D60,PA6,_BV(6),PA,6,ADC6,60,NOT_ON_TIMER,NOT_ON_TIMER
NOT_ON_TIMER,//A7/D61,PA7,_BV(7),PA,7,ADC7,61,NOT_ON_TIMER,NOT_ON_TIMER
};
#endif // Timer defs

#endif // ARDUINO_MAIN


// Missing definitions in iom164pa.h/iom324a.h/iom324p.h/iom324pa.h
#if defined(__AVR_ATmega164PA__) || defined(__AVR_ATmega324A__) || defined(__AVR_ATmega324P__)\
|| defined(__AVR_ATmega324PA__)
  #define SPSR SPSR0
  #define SPDR SPDR0
  #define SPCR SPCR0
  #define SPR0 SPR00
  #define SPR1 SPR10
  #define CPHA CPHA0
  #define CPOL CPOL0
  #define MSTR MSTR0
  #define DORD DORD0
  #define SPE  SPE0
  #define SPIE SPIE0
  #define SPI2X SPI2X0
  #define WCOL WCOL0
  #define SPIF SPIF0
#endif


// Missing definitions in iom324pb.h file + better backwards compatibility
#if defined(__AVR_ATmega324PB__)
  // USART
  #define MPCM0   MPCM
  #define U2X0    U2X
  #define UPE0    UPE
  #define DOR0    DOR
  #define FE0     FE
  #define UDRE0   UDRE
  #define TXC0    TXC
  #define RXC0    RXC
  #define TXB80   TXB8
  #define RXB80   RXB8
  #define UCSZ02  UCSZ2
  #define TXEN0   TXEN
  #define RXEN0   RXEN
  #define UDRIE0  UDRIE
  #define TXCIE0  TXCIE
  #define RXCIE0  RXCIE
  #define UCPOL0  UCPOL
  #define UCSZ00  UCSZ0
  #define UCSZ01  UCSZ1
  #define USBS0   USBS
  #define UPM00   UPM0
  #define UPM01   UPM1
  #define UMSEL00 UMSEL0
  #define UMSEL01 UMSEL1  
  #define MPCM1   MPCM
  #define U2X1    U2X
  #define UPE1    UPE
  #define DOR1    DOR
  #define FE1     FE
  #define UDRE1   UDRE
  #define TXC1    TXC
  #define RXC1    RXC
  #define TXB81   TXB8
  #define RXB81   RXB8
  #define UCSZ12  UCSZ2
  #define TXEN1   TXEN
  #define RXEN1   RXEN
  #define UDRIE1  UDRIE
  #define TXCIE1  TXCIE
  #define RXCIE1  RXCIE
  #define UCPOL1  UCPOL
  #define UCSZ10  UCSZ0
  #define UCSZ11  UCSZ1
  #define USBS1   USBS
  #define UPM10   UPM0
  #define UPM11   UPM1
  #define UMSEL10 UMSEL0
  #define UMSEL11 UMSEL1 
  #define MPCM2   MPCM
  #define U2X2    U2X
  #define UPE2    UPE
  #define DOR2    DOR
  #define FE2     FE
  #define UDRE2   UDRE
  #define TXC2    TXC
  #define RXC2    RXC
  #define TXB82   TXB8
  #define RXB82   RXB8
  #define UCSZ22  UCSZ2
  #define TXEN2   TXEN
  #define RXEN2   RXEN
  #define UDRIE2  UDRIE
  #define TXCIE2  TXCIE
  #define RXCIE2  RXCIE
  #define UCPOL2  UCPOL
  #define UCSZ20  UCSZ0
  #define UCSZ21  UCSZ1
  #define USBS2   USBS
  #define UPM20   UPM0
  #define UPM21   UPM1
  #define UMSEL20 UMSEL0
  #define UMSEL21 UMSEL1
  
  // i2c
  #define TWI_vect TWI0_vect
  #define TWI_vect_num TWI0_vect_num
  #define TWBR TWBR0
  #define TWSR TWSR0
  #define TWS3 TWS03
  #define TWS4 TWS04
  #define TWS5 TWS05
  #define TWS6 TWS06
  #define TWS7 TWS07
  #define TWAR TWAR0
  #define TWDR TWDR0
  #define TWD0 0
  #define TWD1 1
  #define TWD2 2
  #define TWD3 3
  #define TWD4 4
  #define TWD5 5
  #define TWD6 6
  #define TWD7 7
  #define TWCR  TWCR0
  #define TWAMR TWAMR0
  #define TWAM0 TWAM00
  #define TWAM1 TWAM01
  #define TWAM2 TWAM02
  #define TWAM3 TWAM03
  #define TWAM4 TWAM04
  #define TWAM5 TWAM05
  #define TWAM6 TWAM06

  // SPI
  #define SPI_STC_vect SPI0_STC_vect
  #define SPI_STC_vect_num SPI0_STC_vect_num
  #define SPCR SPCR0
  #define SPSR SPSR0
  #define SPDR SPDR0
  #define SPDRB0 0
  #define SPDRB1 1
  #define SPDRB2 2
  #define SPDRB3 3
  #define SPDRB4 4
  #define SPDRB5 5
  #define SPDRB6 6
  #define SPDRB7 7

#endif // 324PB defs

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.

#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE_OPEN   Serial

#if defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega324PB__) ||   \
defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega1284__) ||     \
defined(__AVR_ATmega1284P__)
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial1
#endif

#if defined(__AVR_ATmega324PB__)
#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE_OPEN2  Serial2
#endif

#endif // Pins_Arduino_h
